{
  "auto_map": {
    "AutoTokenizer": [
      "tokenization_InternLM_XComposer.InternLMXComposerTokenizer",
      null
    ]
  },
  "bos_token": "<s>",
  "clean_up_tokenization_spaces": false,
  "eos_token": "</s>",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "</s>",
  "tokenizer_class": "InternLMXComposerTokenizer",
  "unk_token": "<unk>"
}
